package com.sist.main;
/*
 * 1차 ==> 2차 오버라이딩
 * --------------------------재사용
 * 
 * 1. 목적 => 재사용
 *                 ------- 변경이 가능 , 추가가 가능
 *                            ----           ----
 *                            오버라이딩     오버로딩
 *                            면접 : 정의 => 부연 (프로젝트)
 * 2. 신뢰성이 좋다 : 검증을 거친다
 * 3. 대규모 프로젝트 => 재사용
 * 
 * 4. 클래스 => 추상화 => 구체화
 *                   --------설계---------- 구현
 *                   ㅣ공통적인 데이터나 기능을 모아서 설계
 *                      --------------------
 *                         벤치마킹 (CGV , 메가박스 , 롯데시네마)
 *                                    -----------------------------
 *                                    ㅣ불편한 점 => 사용자 편리성
 *                   ㅣ단순화 : 시뮬레이션
 *                   
 *                   ㅣ공통적인 데이터 / 기능
 *                                          ------- 메소드
 *                                                    ------- 동작
 *                                                    메뉴 / 버튼 / 마우스 ...
 *                                                    ----  -----
 *                     ---------------변수
 *                                         -----눈에 보이는 데이터 : 명사형
 * 
 * => 객체지향의 3대 특성 => 권장 (문법 사항은 아니다)
 *       ------------------
 *       1. 캡슐화 => private, getter, setter => 데이터 보호
 *       2. 상속 : 재사용
 *       3. 다형성 : 변경 / 추가
 * 
 *      
 */



public class 정리_6장 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
	}

}
