/*
 * 48page => 삼항연산자 => if~else
 * 삼항연산자 : 소스가 복잡한 경우에 사용 => (HTML + JAVA)
 *    ㅣ
 *      형식) (조건) ? 값1 : 값2
 *           => true => 값1
 *              false => 값2
 * 3장 : 54~55page
 *       조건문 : 필요시에 문장 수행, 필요가 없는 경우에는 건너뛴다
 *              ===== true     ============ false
 *       1) 형식
 *             ㅣ연산자 => 부정연산자, 비교연산자, 논리연산자만 사용이 가능
 *          if(조건문)    =========================== 결과값이 true/false
 *          {
 *          	수행문장 ==> 조건문이 true일 경우에만 수행
 *          }
 *          
 *          ==> 가장 많이 등장하는 조건문 => for
 *          ==> 주의점
 *              ** 가급적이면
 *              if()
 *              {
 *              }
 *              if(); => if문 적용이 안됨
 *              ==>{}은 언제든 사용이 가능
 *              
 *              ==> 반대 ==> !전체조건 => if~else
 *       
 * 
 * 
 * 
 * 
 */
public class 자바제어문정리 {
	public static void main(String[] args) {
	
	}
}
